AcGiDrawableOverrule.viewportDrawLogicalFlags(AcGiDrawable*,AcGiViewportDraw*)
Overrules AcGiDrawable::viewportDrawLogicalFlags method.
Remarks:
The default implementation of AcGiDrawableOverrule::
viewportDrawLogicalFlags calls the protected virtual
AcGiDrawable:: subViewportDrawLogicalFlags method.

AcGiDrawableOverrule.viewportDraw(AcGiDrawable*,AcGiViewportDraw*)
Overrules AcGiDrawable::viewportDraw method.
Remarks:
Default implementation of AcGiDrawableOverrule::viewportDraw
calls protected virtual AcGiDrawable::subViewportDraw method.

AcGiDrawableOverrule.worldDraw(AcGiDrawable*,AcGiWorldDraw*)
Overrules AcGiDrawable::worldDraw.
pSubject: Pointer to an AcRxObject that this
overrule is applied against.
wd: Pointer to the graphics traits.
Remarks:
The default implementation of AcGiDrawableOverrule::worldDraw
calls the protected virtual AcGiDrawable::subWorldDraw
method.

AcGiDrawableOverrule.setAttributes(AcGiDrawable*,AcGiDrawableTraits*)
Overrules AcGiDrawable::setAttributes method.
Remarks:
The default implementation of
AcGiDrawableOverrule::setAttributes calls
AcGiDrawable::subSetAttributes.
pSubject: Pointer to an AcRxObject that this
overrule is applied against.
traits: Pointer to the graphics traits.

AcGiDrawableOverrule
AcGiDrawableOverrule overrules a subset of draw related
operations that AcGiDrawable class specifies. It is intended
as a base class for clients who want to alter some or all
behavior of a given AcGiDrawable-derived class. At the base
level, each default implementation simply calls the
corresponding method in the target class.